omakoto/raspberry-pi-pico/esp32/2026-09-06-w5500-lan-test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (Seeed Studio XIAO ESP32-S3 standard 8MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Custom Partition Table with FATFS storage
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# SPI Ethernet Support (W5500 MAC RAW mode)
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# FreeRTOS 1kHz tick rate
CONFIG_FREERTOS_HZ=1000

# FATFS & Wear Levelling Configuration
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_SECTOR_512=y
CONFIG_WL_SECTOR_SIZE_512=y

# Console Output: Default UART with secondary USB Serial/JTAG (Native USB on XIAO ESP32-S3)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Networking & Stack sizing
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
